### Data Analytics: Lab 5

In [3]:
import pandas as pd

1) Write Python code to create the 3 dfs above.

Hint: df = pd.DataFrame(data) where data is a dictionary with keys = column names, values = list of data in the corresponding columns

In [4]:
data_players = {'Player': ['Milner', 'Coutinho', 'Kane', 'Son', 'Rooney', 'Baines', 'Hazard'],
                'Team': ['Liverpool', 'Liverpool', 'Tottenham', 'Tottenham', 'Everton', 'Everton', 'Chelsea'],
                'Goals': [2, 5, 10, 6, 4, 1, 7],
                'Assists': [12, 4, 4, 10, 7, 1, 8]}
data_teams = {'Team': ['Liverpool', 'Tottenham', 'Everton', 'Chelsea'],
              'Home_City': ['Liverpool', 'London', 'Liverpool', 'London'],
              'Num_Fans': [0.2, 2.3, 0.1, 5.1]}
data_city = {'City': ['London', 'Liverpool'],
             'Population': [9.0, 0.5]}

df_players = pd.DataFrame(data_players)
df_teams = pd.DataFrame(data_teams)
df_city = pd.DataFrame(data_city)

df_players

     Player       Team  Goals  Assists
0    Milner  Liverpool      2       12
1  Coutinho  Liverpool      5        4
2      Kane  Tottenham     10        4
3       Son  Tottenham      6       10
4    Rooney    Everton      4        7
5    Baines    Everton      1        1
6    Hazard    Chelsea      7        8

In [5]:
df_teams

        Team  Home_City  Num_Fans
0  Liverpool  Liverpool       0.2
1  Tottenham     London       2.3
2    Everton  Liverpool       0.1
3    Chelsea     London       5.1

In [6]:
df_city

        City  Population
0     London         9.0
1  Liverpool         0.5

2) Merge the 3 dfs (called df_merged) using only 1 line of code. Hint: pd.merge(pd.merge(… ))

In [38]:
# Merge 3 dfs
df_merged = df_players.merge(df_teams.merge(df_city, how='inner', left_on='Home_City', right_on='City'),
                             how='inner', left_on='Team', right_on='Team')
df_merged

,Team,Player,Goals,Assists,Home_City,Num_Fans,City,Population
0,Liverpool,Milner,2,12,Liverpool,0.2,Liverpool,0.5
1,Liverpool,Coutinho,5,4,Liverpool,0.2,Liverpool,0.5
2,Tottenham,Kane,10,4,London,2.3,London,9.0
3,Tottenham,Son,6,10,London,2.3,London,9.0
4,Everton,Rooney,4,7,Liverpool,0.1,Liverpool,0.5
5,Everton,Baines,1,1,Liverpool,0.1,Liverpool,0.5
6,Chelsea,Hazard,7,8,London,5.1,London,9.0

3) Join the 3 dfs (called df_joined). You might need to set_index() before you could join
them

In [41]:
df_players_temp = df_players.set_index('Team')
df_teams_temp = df_teams.set_index('Home_City')
df_city_temp = df_city.set_index('City')

# Join 3 dfs
# First, join city with teams, then join with players
df_joined = df_players_temp.join(df_city_temp.join(df_teams_temp).set_index('Team'))
df_joined

             Player  Goals  Assists  Population  Num_Fans
Team
Liverpool    Milner      2       12         0.5       0.2
Liverpool  Coutinho      5        4         0.5       0.2
Tottenham      Kane     10        4         9.0       2.3
Tottenham       Son      6       10         9.0       2.3
Everton      Rooney      4        7         0.5       0.1
Everton      Baines      1        1         0.5       0.1
Chelsea      Hazard      7        8         9.0       5.1

4) Remove Home_City from df_merged

In [42]:
df_merged = df_merged.drop(columns='Home_City')
df_merged

        Team    Player  Goals  Assists  Num_Fans       City  Population
0  Liverpool    Milner      2       12       0.2  Liverpool         0.5
1  Liverpool  Coutinho      5        4       0.2  Liverpool         0.5
2  Tottenham      Kane     10        4       2.3     London         9.0
3  Tottenham       Son      6       10       2.3     London         9.0
4    Everton    Rooney      4        7       0.1  Liverpool         0.5
5    Everton    Baines      1        1       0.1  Liverpool         0.5
6    Chelsea    Hazard      7        8       5.1     London         9.0

5) Find the player with the highest goals and then print out his statistics

In [44]:
df_merged[df_merged['Goals'] == df_merged['Goals'].max()]

        Team Player  Goals  Assists  Num_Fans    City  Population
2  Tottenham   Kane     10        4       2.3  London         9.0

Find the total number of goals of players from the same teams. Print out just the teams and the total goals.

In [45]:
df_merged.groupby('Team')['Goals'].sum()

Team
Chelsea       7
Everton       5
Liverpool     7
Tottenham    16
Name: Goals, dtype: int64

7) Use filter, print out players from London who scored more than 2 goals.

In [46]:
df_merged[(df_merged['City'] == 'London') & (df_merged['Goals'] > 2)]

        Team  Player  Goals  Assists  Num_Fans    City  Population
2  Tottenham    Kane     10        4       2.3  London         9.0
3  Tottenham     Son      6       10       2.3  London         9.0
6    Chelsea  Hazard      7        8       5.1  London         9.0

8) Print out the TOP player (by total goals and assists) from each team. Only show his
name, team, total goals and assists.

In [48]:
df_merged['Goal Contributions'] = df_merged['Goals'] + df_merged['Assists']
df_merged.groupby('Team')[['Player', 'Goal Contributions']].max()

           Player  Goal Contributions
Team
Chelsea    Hazard                  15
Everton    Rooney                  11
Liverpool  Milner                  14
Tottenham     Son                  16

9) Insert a new column called “Star” that gives a “*” to players whose total goals and
assists are greater than 12. Otherwise, just leave it empty.

In [50]:
df_merged['Star'] = " "
# Add star to the row with goal contributions > 12
df_merged.loc[df_merged['Goal Contributions'] > 12, 'Star'] = '*'
df_merged[['Player', 'Team', 'Goal Contributions', 'Star']]

     Player       Team  Goal Contributions Star
0    Milner  Liverpool                  14    *
1  Coutinho  Liverpool                   9
2      Kane  Tottenham                  14    *
3       Son  Tottenham                  16    *
4    Rooney    Everton                  11
5    Baines    Everton                   2
6    Hazard    Chelsea                  15    *

10) Create a dictionary D {“Player”: Goal} using df. iterrows()

In [52]:
D = {}
for index, row in df_merged.iterrows():
    D[row['Player']] = row['Goals']

D

{'Milner': 2,
 'Coutinho': 5,
 'Kane': 10,
 'Son': 6,
 'Rooney': 4,
 'Baines': 1,
 'Hazard': 7}